# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'neovim/neovim'
tap 'rogual/neovim-dot-app'

# Java dependency
cask 'java'                                 # for working with internet banking

# Install Binaries
brew 'awscli'                               # AWS cli
brew 'awsebcli'                             # AWS ElasticBeanstalk cli
brew 'dnscrypt-proxy'                       # allows using DNS via HTTPS
brew 'git'                                  # version controll system
brew 'go'                                   # programming language
brew 'mackup'                               # macOS config synchronization tool
# brew 'mongodb'                            # noSQL database
brew 'mas'                                  # allows to install apps from Apple AppStore
brew 'neovim'                               # alternative editor to vim
brew 'neovim-dot-app'                       # saparate app for neovim
brew 'node'                                 # node.js engine
brew 'peco'                                 # powerful alternative to grep
brew 'redis'                                # in memory key value database
brew 'trash'                                # allow to "Send to trash" from commands line
brew 'tree'                                 # show file tree
brew 'watchman'                             # needed for watch operations in node projects
brew 'wget'                                 # download client
brew 'zsh'                                  # shell alternative to bash
brew 'zsh-autosuggestions'                  # zsh plugin to get suggestions while typing commands
brew 'zsh-completions'                      # zsh plugin to simplify commands completion
brew 'zsh-history-substring-search'         # zsh plugin to navigate history easier
brew 'zsh-syntax-highlighting'              # zsh plugin

# Apps
cask 'aerial'                               # Apple TV Aerial screen saver
cask 'alfred'                               # Alfred (great clipboard history)
cask 'appcleaner'                           # App for deleting apps
cask 'docker'                               # virtualization containers management
cask 'google-chrome'                        # browser
cask 'grammarly'                            # spell checking
cask 'insomnia'                             # http client
cask 'iterm2'                               # terminal app
cask 'java'                                 # for working with internet banking
cask 'mongodb'                              # noSQL database UI
cask 'postman'                              # http client
cask 'raindropio'                           # bookmarks
cask 'rescuetime'                           # time tracking app
cask 'robo-3t'                              # mongodb client
cask 'sip'                                  # color picking tool
cask 'sizeup'                               # arrang windows
cask 'sourcetree'                           # git client
cask 'teamviewer'                           # remote control
cask 'torbrowser'                           # browser to use tor network
cask 'transmission'                         # torrent client
cask 'visual-studio-code'                   # ide
cask 'vlc'                                  # video player

# Paid apps
cask 'backblaze'                            # backup system
cask 'bartender'                            # hide icons in macOS menu bar
cask 'beamer'                               # stream videos to Apple TV
cask 'daisydisk'                            # analyze disk usage in a visual way
cask 'expressvpn'                           # VPN client
cask 'microsoft-office'                     # Microsoft Word, Excel etc.
cask 'sketch'                               # vector editor
cask 'transmit'                             # ftp client

# Quicklook
# cask 'qlcolorcode'                        # impossible to install...
cask 'qlmarkdown'                           # renders markdown
cask 'quicklook-json'                       # renders json
cask 'quicklook-csv'                        # renders csv
cask 'qlstephen'                            # renders files without extensions (e.g. README)

# Fonts
cask 'font-droid-sans-mono-for-powerline'   # font for iTerm with extra icons
cask 'font-fira-code'                       # font for vs studio code with lingering support
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas '1Blocker', id: 1107421413              # ads blocker for safari
mas '1Password 7', id: 1333542190           # password manager
mas 'Agenda', id: 1287445660                # work related markdown editor
mas 'Amphetamine', id: 937984704            # prevent laptop from sleeping
mas 'Commander One', id: 1035236694         # file manager
mas 'Day One', id: 1055511498               # markdown based journalig app
mas 'Deliveries', id: 924726344             # delivery notifcations
# mas 'EyeFitness', id: 1114775590          # eye training app
mas 'Friendly Streaming', id: 553245401     # client for Netflix etc.
mas 'Keynote', id: 409183694                # Apple keynotes editor
mas 'Medis', id: 1063631769                 # redis client
mas 'Mediunic', id: 1088945121              # medium client
mas 'Monit', id: 1014850245                 # sidebar CPU/memory/... widget
mas 'Numbers', id: 409203825                # Apple spreadsheets editor
mas 'Pages', id: 409201541                  # Apple rich text editor
mas 'Paste', id: 967805235                  # clipboard history
mas 'PDF Expert', id: 1055273043            # powerful PDF reader
mas 'PopClip', id: 445189367                # iOS style copy/paste menu
# mas 'Reeder', id: 880001334               # news reader
mas 'Slack', id: 803453959                  # team communication tool
mas 'The Unarchiver', id: 425424353         # archiving tool
mas 'Things3', id: 904280696                # task manager
mas 'UlyssesMac', id: 1225570693            # markdown editor
mas 'Xcode', id: 497799835                  # Apple IDE
mas 'Wallpaper Wizard', id: 1266674560      # wallpaper manager
