# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Install Binaries
brew 'awscli'
brew 'awsebcli'
brew 'dnscrypt-proxy'
brew 'git'
brew 'go'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'peco'
brew 'redis'
brew 'trash'
brew 'tree'
brew 'watchman'
brew 'wget'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'

# Apps
cask 'aerial'                   # Apple TV Aerial screen saver
cask 'alfred'                   # Alfred (great clipboard history)
cask 'backblaze'                # backup system
cask 'bartender'                # hide icons in macOS menu bar
cask 'beamer'                   # stream videos to Apple TV
cask 'daisydisk'                # analyze disk usage in a visual way
cask 'docker'
cask 'expressvpn'               # VPN
cask 'google-chrome'            # brewser
cask 'grammarly'
cask 'insomnia'                 # http client
cask 'iterm2'                   # terminal app
cask 'java'                     # for working with internet banking
cask 'microsoft-office'         # MS office
cask 'mongodb'                  # noSQL database UI
cask 'postman'                  # http client
cask 'raindropio'               # bookmarks
cask 'rescuetime'               # time tracking app
cask 'robo-3t'                  # mongodb client
cask 'sip'                      # color picking tool
cask 'sizeup'                   # arrang windows
cask 'sketch'                   # vector editor
cask 'sourcetree'               # git client
cask 'teamviewer'               # remote control
cask 'torbrowser'
cask 'transmit'                 # ftp client
cask 'visual-studio-code'       # ide
cask 'vlc'                      # video player

# Quicklook
# cask 'qlcolorcode'            # impossible to install...
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-droid-sans-mono-for-powerline'
cask 'font-fira-code'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas '1Blocker', id: 1107421413
mas '1Password 7', id: 1333542190
mas 'Agenda', id: 1287445660
mas 'Amphetamine', id: 937984704
mas 'Commander One', id: 1035236694
mas 'Day One', id: 1055511498
mas 'Deliveries', id: 924726344
mas 'EyeFitness', id: 1114775590
mas 'Friendly Streaming', id: 553245401
mas 'Keynote', id: 409183694
mas 'Medis', id: 1063631769
mas 'Mediunic', id: 1088945121
mas 'Monit', id: 1014850245
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Paste', id: 967805235
mas 'PDF Expert', id: 1055273043
mas 'PopClip', id: 445189367
mas 'Reeder', id: 880001334
mas 'Slack', id: 803453959
mas 'The Unarchiver', id: 425424353
mas 'Things3', id: 904280696
mas 'UlyssesMac', id: 1225570693
mas 'Xcode', id: 497799835
mas 'Wallpaper Wizard', id: 1266674560
